# flake8: noqa

welcome_message = """
Привет! 🎉 Я бот, созданный для того, чтобы вы могли предлагать новости в канал 3.14! 🌐

💡 Каждый пост перед публикацией пройдет модерацию, и автор, предложивший новость, будет указан. 

👉 Чтобы предложить пост, нажмите кнопку "Предложить пост". 
📲 Для перехода в канал воспользуйтесь кнопкой "Перейти в канал". 
🛠️ Если у вас есть вопросы, вы можете связаться с админом, нажав "Связаться с админом".

Давайте вместе сделаем наш канал еще лучше! 🚀
"""

request_text = """
Предложите свою новость!

1. Уважение: Все посты должны быть уважительными. Избегайте оскорблений. 🤝

2. Тематика: Публикации должны соответствовать ценностям академии. Делитесь знаниями и интересными идеями! 📚✨

3. Креативность: Приветствуем оригинальные идеи и юмор! 😄🎨

4. Информативность: Посты должны быть полезными и интересными для участников. 📰💡

5. Модерация: Все предложения будут проверяться. Мы можем отклонить неподходящие посты. 🔍

6. Обратная связь: Если есть вопросы, обращайтесь к администратору! 📩
"""